Hisim_SGLang_Data_20260612_numa_same_cpu/smoke/smoke_rr4_il256_ol128.log
benchmark_args=Namespace(backend='sglang-oai', base_url=None, host='127.0.0.1', port=32302, dataset_name='random-ids', dataset_path='', model='/mnt/nfs02/users/tjiang/Gitrepo/models/Qwen3-8B', served_model_name=None, tokenizer=None, num_prompts=40, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=256, random_output_len=128, random_range_ratio=0.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=4.0, use_trace_timestamps=False, max_concurrency=None, output_file='/mnt/nfs02/users/tjiang/Gitrepo/sglang/pd_numa_same_cpu_sweep_20260612/smoke/smoke_rr4_il256_ol128.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=True, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)
Namespace(backend='sglang-oai', base_url=None, host='127.0.0.1', port=32302, dataset_name='random-ids', dataset_path='', model='/mnt/nfs02/users/tjiang/Gitrepo/models/Qwen3-8B', served_model_name=None, tokenizer=None, num_prompts=40, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=256, random_output_len=128, random_range_ratio=0.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=4.0, use_trace_timestamps=False, max_concurrency=None, output_file='/mnt/nfs02/users/tjiang/Gitrepo/sglang/pd_numa_same_cpu_sweep_20260612/smoke/smoke_rr4_il256_ol128.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=True, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)

#Input tokens: 6383
#Output tokens: 2222
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang-oai
Traffic request rate:                    4.0       
Max request concurrency:                 not set   
Successful requests:                     40        
Benchmark duration (s):                  13.59     
Total input tokens:                      6383      
Total input text tokens:                 6383      
Total input vision tokens:               0         
Total generated tokens:                  2222      
Total generated tokens (retokenized):    2189      
Request throughput (req/s):              2.94      
Input token throughput (tok/s):          469.54    
Output token throughput (tok/s):         163.45    
Peak output token throughput (tok/s):    330.00    
Peak concurrent requests:                9         
Total token throughput (tok/s):          633.00    
Concurrency:                             2.04      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   694.53    
Median E2E Latency (ms):                 710.14    
---------------Time to First Token----------------
Mean TTFT (ms):                          55.05     
Median TTFT (ms):                        52.21     
P99 TTFT (ms):                           139.95    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          11.72     
Median TPOT (ms):                        11.68     
P99 TPOT (ms):                           12.90     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           11.73     
Median ITL (ms):                         11.63     
P95 ITL (ms):                            12.69     
P99 ITL (ms):                            13.63     
Max ITL (ms):                            129.83    
==================================================